{
    "GOMSF: Graph-Optimization based Multi-Sensor Fusion for robust UAV pose estimation":[
        {
            "Abstract": ["通过无人机自身的传感器和外部测量来对无人机的姿态和位置估计是作为无人机完成其他任务的基础,",
            "这篇文章主要通过一种基于*图优化*的的方式提出一种多传感器数据融合的方法，并且将姿态估计与其解耦."],
            "Author":["Ruben Mascaro",
                      "Lucas Teixeira", 
                      "Timo Hinzmann",
                      "Roland Siegwart",
                      "Margarita Chli"],
            "Introduction":["过去的算法通常针对单源传感器的输入或者特定的传感器套件,",
                        "那么对于传感器的损坏,也就是单个值出现很大误差，最终的值会很敏感",
                        "所以如今的算法都是向更复杂的多传感器数据融合方法转变.如今结合摄像机和惯性传感器的状态估计，",
                    "虽然在大多数非结构化场景中运行地不错，但是视觉惯性测距的算法容易造成漂移，所以也需要全局定位来修正.",
                    "这篇文章的目标是建立一个在估计上局部平滑，且能照顾全局的轨迹的多传感器数据融合算法"],
            "Method":["在状态转移图上增加额外的边解耦限制，通过解一个图优化问题来得到最优估计"]
        }
    ],
    "Human Motion Capture Using a Drone":[
        {
            "Abstract":["提出一种3d重建算法，使用一个板载的RGB摄像头对人类进行3d运动捕捉"],
            "Author":["Xiaowei Zhou",
                "Sikang Liu",
                "Georgios Pavlakos",
                "Vijay Kumar",
                "Kostas Daniilidis"
            ],
            "Introduction":["过去的运动捕捉算法都是基于受限的多摄像机环境，该方法通过无人机的高机动性来录制视频，",
            "再对视频进行运动重建，主要的贡献是提出一种重建算法，并且发布了一个基于无人机的Mocap数据集"],
            "Method":["首先用Faster-RCNN确定boundingBox，通过stacked hourglass model 来进行2d姿态估计，",
            "这个模型的输出是一组对于关节（joints）的概率热力图,然后通过单视图重建姿势方法来进行初始化，",
            "再从Mocap中学习一个姿势的字典可以有效地在重建中规避异常点，并且对于连续帧进行捆绑优化"]           
        }
        
    ],
    "Coordinated dense aerial trafﬁc with self-driving drones":[
        {
            "Abstract":["提出了一种基于自动无人机的通用分散式交通控制解决方法"],
            "Author":["Boldizs´ar Bal´azs",
                     "G´abor V´as´arhelyi"],
            "Introduction":["该文章假设未来的时候，在相同空域中的无人机会爆炸式增长，那么对于航空交通问题",
            "不同于地面交通的规划问题在于，这个是3d环境下，采用分散式的代理算法，考虑到集中式路径规划有许多",
        "比如通信和计算上的复杂，一方面利用基于力的仿真模型，也用30个全自动无人机进行实际现场实验"]
        
        }
    ],
    "Full Convolutional Networks for Semntic Segmentation":[

    ],
    "Distance-Based Multi-Robot Coordination on Pocket Drones":[
        {
            "Abstract":["该文章提出了一种基于距离信息的无人机分散协调机制,通过循环神经网络提供方位信息，DQN来选择合适的策略"],
            "Author":["Bastian Broecker",
                "Karl Tuyls",
            "James Butterworth"],
            "Introduction":["协作是多无人机中永恒的问题，在一些大型无人机中，可以装载更多的传感器,",
                "或者某些借助中心控制系统，而这篇文章旨在轻量级硬件的解决方案，利用UWB进行三角测距，部分环境信息提供估计状态",
                "那么通过神经网络从状态中提取特征可以使得运动决策变为可能。"
            ],
            "Method":[
                "首先把问题简化至二维，那么一方面减少了建模难度，另外一方面在真实情况下可以忽略无人机",
                "向下的风对其他无人机的影响，数据来源于两架无人机在2m*2m的区域内进行飞行,通过RNN估计相对于",
                "目标的角度和其他一个无人机的角度，而该网络的输入为(dt{间隔时间}，do{跟目标的距离}，vx，vy，vox，voy),",
                "这些输入通过粒子滤波器来稳定估计,其状态的估计则是DQN的输入",
                "决策通过DQN，编码每隔45°外加一个减速形成一个one-hot的向量，2维坐标上的目标坐标和障碍坐标这些都来源于粒子滤波器，和自身的",
                "速度这些来源于mcs。"
            ]
        }
    ],
    "Using Information Invariants to Compare Swarm Algorithms and General Multi-Robot Algorithms":[
        {
            "Abstract":["本文主要通过在给定应用域的前提下，比较机器人群和一般性多机器人的算法",
            "并且通过信息不变量理论进行分析。"],
            "Author":["Gabriel Arpino","Kyle Morris"," Sasanka Nagavalli"],
            "Introduction":["现有的多机器人协作论文都集中于集群特征的组合选择下的研究",
            "比如集中控制还是分布式，局部信息还是全局信息，反应式还是主动协作等等，",
        "这篇文章面向的是仅能访问局部信息的机器人集群，应用上选择导航和动态区域覆盖的相应算法，",
        "进行比较，目的是为了突出general的算法和集群算法的优缺点，这样在给定应用场景下，可以",
        "选择合适的机器人群"],
            "Method":["这里所讨论的方法指的是所比较的应用算法：1.势场法，2： Proportional Barrier Certiﬁcates，",
            "3.DMA-RRT,4。个人动态覆盖5.群动态覆盖"]
        }
        
    ],
    "Network Topology Inference in Swarm Robotics":[
        {
            "Abstract":["通过构建swarm中的拓扑图和拓扑关系推理来估计全局行为参数"],
            "Author":["Bruno Luis",
            " Mend´ıvez V´asquez",
            " Jan Carlo Barca"],
            "Introcution":["所谓网络拓扑则是个体信息交换的逻辑结构，代理之间的影响称为拓扑链接，",
            "从动态的拓扑变化中来推断全局行为参数对于整个集群智能系统是必须的，，群体通信范围和领导者被认为是主要的推断群参数。"],
            "Method":["首先对于群体个体的变化位置进行时间步长的Delaunay三角剖分，然后边缘（agent之间的关系）在时间步上跟踪分组",
            "每一组点边关系的轨迹是与相应的时间帧所匹配，这种轨迹距离可以用来判断这个edge的权重，然后方向也可以被推断出来"]
        }
        
    ],
    "Self-triggered Adaptive Planning and Scheduling of UAV Operations":[
        {
        "Abstract":["这篇文章其实就是通过风险分析来减少无人机对于计算资源的依赖并提出了一个online的自适应框架"],
        "Author":["Esen Yel","Tony X. Lin"," Nicola Bezzo"],
        "Introduction":["无人机的许多应用通过周期性校准路径来提高无人机的运动避障能力，这就意味着",
        "大量能量和计算资源的消耗,如果能够提前预估未来状态的可能性，那么在一段时间内就可以减少对传感器的",
    "采集和计算，所以目标就是最大限度地减少传感器检查和重新规划操作，同时保证安全性和活跃性并且通过调整",
    "其速度解决漂移问题"]
    }
],
    "BFM: a Scalable and Resource-aware Method for Adaptive Mission Planning of UAVs":[
       {
           "Abstact":["提出了一种新的BFM模型具有模块化和全面化，把不同类型的诊断模块合并到mdp中，来实现",
            "无人机的任务规划"],
           "Author":["Chabha Hireche",
                " Catherine Dezan",
            "Jean-Philippe Digue",
                "Luis Mejias"],
            "Introduction":["出了一种可扩展的方法来全局管理基于关注点分离的不同级别的决策，",
                "以便每种类型的专家（无人机任务，健康管理，嵌入式系统/应用程序）可以全面关注他们的技能领域数据。",
                "它产生了三个主要贡献。第一个是模块化和可扩展的方法，以解决全球决策过程。它基于任务级别的马尔可夫决策过程（MDP），",
                "由多个专用贝叶斯网络（BN）提供支持。第二个是使用基于扩展故障模式和影响分析（FMEA）表的BN来计算解决方案的概率，"

            ]
        }
    ],
    "Distributed Real Time Control of Multiple UAVs in Adversarial Environment: Algorithm and Flight Testing Results":[
        {
            "Abstact":["提供了一种多无人机捕捉游戏的系统贡献包括对无人机的改造，分布式轨迹规划算法，以及基于wifi的通信基础实现"],
            "Author":["Mohamed Abdelkader",
                 " Yimeng Lu",
             " Hassan Jaleel",
                 " Jeff S. Shamma"],
             "Introduction":["多无人机的分布式路径规划是研究热点，但是其高复杂性，高不确定性等因素",
                 "使得整个部署变得非常难，而这个无人机捕捉游戏，是攻击者和防御者之间的对抗性游戏，",
                 "首先再Gazebo中模拟了完整的系统，在具体实施的时候把四旋翼的无人机上配备了低功耗计算的模块和通信模块",
                 "板载路径规划使用C++实现算法"
             ]
         }
     ],
    "Vision based Collaborative Path Planning for Micro Aerial Vehicles":[
        {
            "Abstract":["提出了一种能够对Mavs通过视觉进行本地化协作路径规划框架"],
            "Author":["Sai Vemprala ",
                " Srikanth Saripalli"],
            "Introduction":["通过每个Mav上的单目摄像头和初始位置信息来进行导航，",
            "构建3d地图，以协作方式来进行路径规划，以减少误差和计算，第一步也就是通过",
        "不同的无人机视点来进行3d地图的绘制，第二步再规划到目标点的路径"]

        }
    ],
    "Viewpoint-tolerant Place Recognition combining 2D and 3D information for UAV navigation":[
        {
            "Abstract":["改进原有视觉测距法，利用有效的二进制特征和局部三维几何的噪声估计做定位和mapping"],
            "Author":["Fabiola Maffra"," Zetao Chen "," Margarita Chli "],
            "Introduction":["无人机在做地图重建和定位时的挑战主要在于微小误差的时间累计爆炸，",
            "第二个就是往往同一个目标需要多个视角的观察，利用Vicon作为（ground-truth）"]
        }
        
    ],
    "Visual Saliency–aware Receding Horizon Autonomous Exploration with Application to Aerial Robotics":[
        {
            "Abstract":["提出了一种新的基于视觉未知环境探测算法"],
            "Author":["Tung Dang"," Christos Papachristos","Kostas Alexis"],
            "Introduction":["本文主要聚焦的问题在于视觉探测算法中的注意力模型，",
            "整个实验都在室内进行，仅仅依靠视觉惯性定位，目标是使得其能够实现自主探测，",
        "并且能够快速探索完成"]
        }
    ],
    "Visual Inertial Odometry Swarm: An Autonomous Swarm of Vision-Based Quadrotors":[
        {
            "Abstract":["这是一篇关于单目视觉惯性测距的集群无人机应用，包括室内室外都可以部署的编队任务"],
            "Author":["Aaron Weinstein ",
            "Adam Cho"," Giuseppe Loianno ",
            " Vijay Kumar"],
            "Introduction":["大多的swarm系统基于外部的位置反馈装置比如vicon之类，室外用GPS",
            "这类方式通过集中式广播所有uav的位置信息，限制了群的鲁棒性，造价和精度无法得到很好的平衡",
        "所以Visual Odometry应运而生，但是相比其他这方面的工作，这篇文章主要开发了一种可扩展的架构",
    "第二个就是有12个四旋翼飞机可以做自主导航，最大的群"]
        }
    ],
    "Data Ferrying with Swarming UAS in Tactical Defence Networks":[
        {

        }

    ],
    "DroneEARS: Robust Acoustic Source Localization with Aerial Drones":[
        {
            "Abstract":["利用无人机进行声源追踪"],
            "Author":["Prasant Misra",
                    "A. Anil Kumar",
                "Pragyan Mohapatra",
            "Balamuralidhar P"],
            "Introduction":["对多源的声源探测，主要时对复合信号处理，精度40cm在6m*3m的区间内，用的是双耳",
            "传感系统，相比于原先的波束传感阵列，用更少的传感器来克服自身和外界的噪声"],
            "Method":[]

        }   
    ],
    "Ultra-Wideband Radar for Robust Inspection Drone in Underground Coal Mines":[
        {
            "Abstract":["篇文章用于无人机来探索地下煤矿，由于地下煤矿情况复杂，",
            "传统的传感器会由于这些复杂的因素而难以完成任务，所以使用UWB来进行障碍物的检测和矿洞墙体的绘制"],
            "Author":["Fernando Cunha",
            " Kamal Youcef-Toumi"],
            "Introduction":["红外传感器在这个任务上的难度在于地下矿洞经常有很大的煤灰。",
                "而超声波对于这些矿洞的客观问题是很具有鲁棒性的，但是由于超声波本身对于柔软材料",
                "的探测不是很准确，那么很难避免和工人相撞。UWB{具有更高的分辨率，功率下，",
                "对其他无线设备的干扰小"],
            "Method":["模拟地下矿洞环境的容器：除了target（静态）之外，还有些检测煤灰浓度的和湿度的传感器），",
                "主要用于定量地说明UWB雷达传感器的读数不受环境中煤尘和水分的影响。动态的测试是用一个单摆去完成。"]
        }
    ],
    "Cross-Layer Retrofitting of UAVs Against Cyber-Physical Attacks":[
        {
            "Abstract":["提出了一个bluebox的无人机跨层安全框架"],
            "Author":["Fan Fei"," Zhan Tu","Ruikun Y"],
            "Introduction":["这篇论文首先定义了安全的范畴，包括保密性，完整性，可用性",
            "解释为信息的可用权限，防止被破坏链路，主要是地面站",
            "完整性主要指信息的可信度，可用性主要指完整性受损后是否能够完成任务，那么要接管系统"],
        }
    ],
    "Investigation of Communicative Flight Paths for small UnmannedAerial Systems":[
        {
            "Abstract":["本文对于特定飞行路径的人机交互信息做出设计"],
            "Author":["Brittany A. Duncan","Carrick Detweiler1",
                "Evan Beachly"," Alisha Bevins", " Sebasitan Elbaum"],
            "Introduction":["人机交互的方式是通过，小型无人机的特殊飞行轨迹",
            "在部分轨迹设计上参照了来自仿生学的灵感，并且在实验的时候通过人去进行评测"]
        }
    ],
    "Cooperative object transportation by multiple ground and aerial vehicles: modeling and planning":[
        {
            "Abstract":["建模了一个由多空中无人机和地面无人机的运输任务"],
            "Author":["Martina Lippi"," Alessandro Marino"],
            "Introduction":["主要考虑的是地面无人机的精准度，多个空中无人机的拉力能够",
            "提高其负载能力"]
        }
    ],
    "The UNAV, a Wind-Powered UAV for Ocean Monitoring: Performance, Control and Validation":[
        {
            "Abstract":[""]
        }
    ],
    "Design and Analysis of a Fixed-Wing Unmanned Aerial-Aquatic Vehicle":[
        {

        }
    ],
    "Radiation Source Localization in GPS–denied Environments using Aerial Robots":[
        {
            "Abstract":["放射源定位"]
        }
    ]
    

}
